app/views/faculties/show.html.haml

SELECT "groups".* FROM "groups" WHERE "groups"."faculty_id" IN (1)
---
  = @faculty.name
-if !@faculty.groups.blank?