app/views/items/_form.html.haml

SELECT "flows".* FROM "flows"
SELECT "rooms".* FROM "rooms"
---
    = f.label :flow_id
    = f.select :flow_id,Flow.all.map{|c| [c.id] }
  .field
    = f.label :room_id
    = f.select :room_id,Room.all.map{|c| [c.audience,c.id]}
  .field