app/controllers/faculties_controller.rb

SELECT "faculties".* FROM "faculties"
---
  def index
    @faculties = Faculty.all

SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "groups".* FROM "groups" WHERE "groups"."faculty_id" IN (1)
---
  def show
    @faculty = Faculty.includes(:groups).find(params[:id])