app/controllers/flows_controller.rb

  def items
    @flow = Flow.where(params[:id])
    @items = Item.where(:flow_id => Flow.where(:group_id => params[:id]))
---
SELECT "items".* FROM "items" WHERE "items"."flow_id" IN (SELECT "flows"."id" FROM "flows" WHERE "flows"."group_id" = 3)