app/controllers/groups_controller.rb

  def index
    respond_to do |format|
      format.html{@groups = Group.includes(:faculty).all}
---
SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" IN (1)
SELECT "groups".* FROM "groups"

  def edit
    @group = Group.find(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "3"]]

  def flows
    #raise params.inspect
     @flows = Flow.where(:group_id => params[:id])
---
SELECT "flows".* FROM "flows" WHERE "flows"."group_id" = 3