app/controllers/semesters_controller.rb

SELECT "semesters".* FROM "semesters"
---
  def index
      @semesters = Semester.all